" Поддержка цвета
set t_Co=256
set term=xterm-256color

" количество пробелов, которыми символ табуляции отображается в тексте
set tabstop=4
" количество пробелов, которыми символ табуляции отображается при добавлении
set softtabstop=4
" ширины отступов в пробелах, добавляемых командами >> и <<
set shiftwidth=4


" Tab в начале строки добавляет отступ равный shiftwidth
set smarttab
" аменяет символ табуляции на соответствующее количество пробелов
set expandtab
" копирует отступы с текущей строки при добавлении новой
" автоматически выставляет отступы в нужных местах
set smartindent
" копирует отступы с текущей строки при добавлении новой
set autoindent

" Для временного отключения autoident ставим в команде
" :set paste
" а потом
" :set nopaste

" визуальный перенос строк, т.е. строка по-прежнему представляет 
" собой одну строку текста, но Vim отображает ее в нескольких строках.
" по умолчанию set wrap
set nowrap

" Данная вариация работает как wrap...
" ...но переносит строчки не посимвольно, а по словам
" set wrap linebreak nolist

" Где 80 стоит заменить на нужную вам длину строки
"set textwidth=80 


" нумерация строк
set number
" показывает позицию курсора в нижнем, правом углу
set ruler

"set encoding=utf-8
"set termencoding=utf-8

" цветовая схема
colorscheme delek
" colorscheme xoria256
" colorscheme desert
syntax on

" поиск без заглавных букв становится нечувствителен к регистру
set ignorecase
" поиск с заглавными буквами чувствителен к регистру
set smartcase

" подсвечивать результаты поиска
set hlsearch
" подсказывать первое вхождение при вводе шаблона поиска
set incsearch

" строка состояния у последнего окна включена всегда
set laststatus=2
" Отключаем панель табов
set showtabline=0 
"set showtabline=2


" Сохранение действий, даже если вы закрываете и открываете Vim
"set undodir=~/.vim/undofile
"set undofile

" выделите строку, на которой находится курсор
set cursorline
" выделите соответствующие круглые скобки 
set showmatch 
"set cursorcolumn

set showmode

" перенесенные строки не мешались с номерами строк, 8 пробелов
set showbreak=\ \ \ \ \ \ \ \ 
