syntax on
filetype on
colorscheme desert
"colorscheme slate
" цветовая схема
if &term =~ "xterm"
  let &t_Co=256
endif
"
" ---------------------------------------------------------
"
"scriptencoding utf-8
"set encoding=utf-8
"
" ---------------------------------------------------------
"
set nocompatible
"
" ---------------------------------------------------------
"
" количество пробелов, которыми символ табуляции отображается в тексте
set tabstop=4

" количество пробелов, которыми символ табуляции отображается при добавлении
set softtabstop=4

" ширины отступов в пробелах, добавляемых командами >> и <<
set shiftwidth=4

" Tab в начале строки добавляет отступ равный shiftwidth
set smarttab

" заменяет символ табуляции на соответствующее количество пробелов
set expandtab

" по умолчанию табуляция не расширяется до пробелов
" set noexpandtab
"
" ---------------------------------------------------------
"
" отключить автоматическое создание отступов
"set paste

" автоматического отступа новых строк на основе синтаксиса языка
set smartindent

" копирует отступы с текущей строки при добавлении новой
set autoindent

" при автоматическом отступе (autoindent) новая строка копирует
" символы, которые использовались для отступа в существующей строке.
set copyindent
"
" ---------------------------------------------------------
"
" поиск без заглавных букв становится нечувствителен к регистру
set ignorecase

" поиск с заглавными буквами чувствителен к регистру
set smartcase

" подсвечивать результаты поиска
set hlsearch

" подсказывать первое вхождение при вводе шаблона поиска
set incsearch
"
" ---------------------------------------------------------
"
" строка состояния у последнего окна включена всегда
set laststatus=2

" Отключаем панель табов
"set showtabline=0
"set showtabline=2
"
" ---------------------------------------------------------
"
" выделите соответствующие круглые скобки
set showmatch

" Показать соответствующие скобки.
set showmode

" Отобразить (частичную) команду в строке состояния.
set showcmd

" нумерация строк
set number
set relativenumber

" показывает позицию курсора в нижнем, правом углу
set ruler

" выделите строку, на которой находится курсор
set cursorline
"set cursorcolumn
"
" ---------------------------------------------------------
"
" скрытие несохранённых буферов
set hidden
"
" ---------------------------------------------------------
"
" включает визуальный перенос строк (word wrap) без изменения текста.
"set wrap
set nowrap
" переносить по словам
set linebreak
" выключить видимость скрытых символов
"set nolist
"set textwidth=80
"
" ---------------------------------------------------------
"
filetype plugin indent on
set backspace=indent,eol,start
"compatible with version 5.4 and earlier
"set backspace=2
"
" ---------------------------------------------------------
"
au BufNewFile,BufRead *.dovecot.sieve set filetype=sieve
au BufNewFile,BufRead *.bash_aliases set filetype=sh
